# Excercise 1

	Write a Python program to create a random array with 1000 elements and compute the average, variance, standard deviation of the array elements.

# Excercise 2
	Read the iris dataset at https://raw.githubusercontent.com/anshupandey/Machine_Learning_Training/master/datasets/iris.data
    
you can find more information about the dataset at - 
https://github.com/anshupandey/Machine_Learning_Training/blob/master/datasets/IRIS_information

To do:
-	Read the dataset as csv and then attach the column names to the dataframe. Print the head of data
- Print the statistical summary of data.
-	For each species compute the mean of numerical columns and store it in a stats table like:<br>

species    | sepal_length | sepal_width | petal_length | petal_width<br>
setosa     | 	5.006     |   3.428 	|   1.462      |	 0.246 <br>
versicolor |    5.936 	  |   2.770 	|   4.260      |     1.326 <br>
virginica  |    6.588 	  |   2.974	    |   5.552	   |     2.026<br>

# Excercise 3
	Load the dataset “messy_stock_data.tsv” from datasets folder, the dataset is consisting of monthly stock prices in 2015 for AAPL, GOOG, and IBM.
-	Load the dataset using pandas, make sure, you take care that values are tab separated.
-	plot the 'Month' column on the x-axis and the AAPL and IBM prices on the y-axis using a list of column names.

In [1]:
import pandas

,name,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
name,,,,,,,,,,,,,
IBM,IBM,156.08,160.01,159.81,165.22,172.25,167.15,164.75,152.77,145.36,146.11,137.21,137.96
MSFT,MSFT,45.51,43.08,42.13,43.47,47.53,45.96,45.61,45.51,43.56,48.70,53.88,55.40
GOOGLE,GOOGLE,512.42,537.99,559.72,540.50,535.24,532.92,590.09,636.84,617.93,663.59,735.39,755.35
APPLE,APPLE,110.64,125.43,125.97,127.29,128.76,127.81,125.34,113.39,112.80,113.36,118.16,111.73

# Excercise 4
Load the datafile "regiment.csv" and obtain the following results.
The dataset contains the data of 12 soldiers from 3 regiments and 3 companies each. they were sent for training and their score before the training and after the training is provided.
    
   1. Which regiment is the most performing regiment after training.
   2. Which company of which regiment is best company after training.
   3. create a column with name "learning" which shows the amount of learning done by the soldier.
   4. which company of which regiment has made maximum improvement with the training?
   5. Create a new column which shows the improvement made  by the soldier with respect to average improvement made by soldiers of RESPECTIVE REGIMENT. (you will need to use groupby operation and lambda function).
   6. Create 500 dates from 1989-01-01, choose 12 random dates and assign it as dateof birth for the soldiers. you need to create new column with name "dob" in the existing dataframe.
   7. Write code to create a new column "age" using the previously created column "dob"